---
kind: type
id: T:Autodesk.Revit.DB.StructuralBehavior
source: html/f3f7bac9-221a-2b0e-1465-5b86dd8454b2.htm
---
# Autodesk.Revit.DB.StructuralBehavior

Specifies whether structural elements behave orthotropically, isotropically, or transverse-isotropically.

## Syntax (C#)
```csharp
public enum StructuralBehavior
```